#include <stdio.h>
#include <stdlib.h>

// 6、定义数组指针指向一维数组，通过数组指针遍历输出数组的所有元素
 int main(int argc, char const *argv[])
 {
     int arr[10]={1,2,3,4,5,6,7,8,9,0};
     int (*p)[10]=&arr;
     printf("通过数组指针去遍历数组元素为：\n");
     for(int i=0;i<10;i++)
     {
        // printf(" %d ",*(*p+i));        //推荐前两种写法
        printf(" %d ",(*p)[i]);           //推荐前两种写法
        // printf(" %d ",i[*p]);          //反人类写法
        // printf(" %d ",*(*(p+1)-1-i));  //反人类写法
    }
    printf("\n");
    return 0;
}

// // 7、编写代码验证数组名的3种第一含义场景，对比arr与&arr的地址与步长差异
// int main(int argc, char const *argv[])
// {
//     int arr[5]={1,2,3,4,5}; //表示整个数组的第一场景
//     sizeof(arr);            //表示整个数组的第二场景
//     int (*p_arr)[5]=&arr;            //表示整个数组的第三场景
//     int *p=arr;
//     printf("arr的步长(移动几个字节)为%p\n",arr);
//     printf("arr的步长(移动几个字节)为%p\n",arr+1);
//     printf("arr的步长(移动几个字节)为%p\n",&arr+1);
//     printf("-----------------------------------------------------------\n");
//     printf("普通指针（指向数组首元素的指针）的地址为%p\n",p);
//     printf("普通指针（指向数组首元素的指针）的步长(移动几个字节)为%p\n",p+1);
//     printf("数组指针的的地址为%p\n",p_arr);
//     printf("数组指针的步长(移动几个字节)为%p\n",p_arr+1);
//     return 0;
// }

// // 8、用4种等价的下标写法，遍历输出一个一维整型数组的所有元素
// int main(int argc, char const *argv[])
// {
//     int arr[5] = {1, 2, 3, 4, 5};
//     printf("第一种下标写法遍历出的数组元素为:\n");
//     for (size_t i = 0; i < 5; i++)
//     {
//         printf(" %d ", arr[i]);         //常用写法
//     }
//     printf(" \n ");
//     printf("第一种下标写法遍历出的数组元素为:\n");
//     for (size_t i = 0; i < 5; i++)
//     {
//         printf(" %d ", *(arr+i));
//     }
//     printf(" \n ");
//     printf("第二种下标写法遍历出的数组元素为:\n");
//     for (size_t i = 0; i < 5; i++)
//     {
//         printf(" %d ", *(i+arr));
//     }
//     printf(" \n ");
//     printf("第三种下标写法遍历出的数组元素为:\n");
//     for (size_t i = 0; i < 5; i++)
//     {
//         printf(" %d ", arr[i]);
//     }
//     printf(" \n ");
//     printf("第四种下标写法遍历出的数组元素为:\n");
//     for (size_t i = 0; i < 5; i++)
//     {
//         printf(" %d ",i[arr]);
//     }
//     printf(" \n ");
//     return 0;
// }

// 9、定义一个二维数组arr[5][6]，通过公式计算并访问第23个元素（从0开始计数），验证结果是否正确
// int main(int argc, char const *argv[])
// {
//     int arr[5][6] = {
//         {0, 1, 2, 3, 4, 5},
//         {6, 7, 8, 9, 10, 11},
//         {12, 13, 14, 15, 16, 17},
//         {18, 19, 20, 21, 22, 23},
//         {24, 25, 26, 27, 28, 29}};
//     int row = 23 / 6; // 行数等于第n个元素除以列
//     int col = 23 % 6; // 行数等于第n个元素取余列
//     printf("通过公式计算的第23个元素为%d\n", arr[row][col]);
//     return 0;
// }

// 10、用数组指针实现二维数组的遍历，不使用数组下标，仅用指针运算
// int main(int argc, char const *argv[])
// {
//     int arr[5][6] = {
//         {0, 1, 2, 3, 4, 5},
//         {6, 7, 8, 9, 10, 11},
//         {12, 13, 14, 15, 16, 17},
//         {18, 19, 20, 21, 22, 23},
//         {24, 25, 26, 27, 28, 29}};
//     int (*p)[6]=arr;
//     printf("通过数组指针去访问二维数组：");
//     for (size_t i = 0; i < 5; i++,p++)
//     {
//         for (size_t j = 0; j < 6; j++)
//         {
//             printf(" %d ",(*p)[j]);
//         }.
//     }
//     printf(" \n ");
//     return 0;
// }

// int main(int argc, char const *argv[])
// {
//     int arr[2][5][6] = 
//     {
//     {
//         {0, 1, 2, 3, 4, 5},
//         {6, 7, 8, 9, 10, 11},
//         {12, 13, 14, 15, 16, 17},
//         {18, 19, 20, 21, 22, 23},
//         {24, 25, 26, 27, 28, 29}
//     },
//     {
//         {0, 1, 2, 3, 4, 5},
//         {6, 7, 8, 9, 10, 11},
//         {12, 13, 14, 15, 16, 17},
//         {18, 19, 20, 21, 22, 23},
//         {24, 25, 26, 27, 28, 29}
//     }
//     };
//     int (*p)[2][5][6]=&arr;
//     // for (size_t i = 0; i < 5; i++)
//     // {
//     //     for (size_t j = 0; j < 6; j++)
//     //     {
//     //         printf(" %d \n",(*p)[i][j]);
//     //     }
//     // }
//     // printf(" \n ");
//     for (size_t i = 0; i < 60; i++)
//     {
//         printf(" %d \n",*(*(*(*p))+i));
//     }
//     printf(" \n ");
//     return 0;
// }
