#include <stdio.h>

int main()
{
    int arr[5] = {3, 4, 5, 1, 2};

    // int arr2[5] = {3, 4, 5};

    // int arr3[] = {3, 4, 5, 1, 2};

    // //零长数组
    // int arr4[] = {};
    // //数组在定义的时候必须确定他的大小
    // //int arr[];

    // // 第二含义：代表首元素地址，等价于 &arr[0]
    // int *p = arr;
    // // 首元素地址+1，步长为1个int类型大小(移动四个字节)，指向arr[1]
    // int *p1 = arr + 1;
    // printf("*p:%d *p1:%d\n", *p, *p1); // 输出：*p:3 *p1:4

    // 第一含义：&arr代表整个数组的地址
    // 整个数组地址+1，步长为整个数组的大小（5个int）
    int *p1 = arr;
    int *p2 = (int *)(&arr);
    int *p3 = (int *)(0x7ffe72496944);
    

    printf("arr数组总大小：%zu字节\n", sizeof(arr)); // 输出20字节（32位int）

    // // 第一含义场景示例
    // int a[3];                   // 此处a代表整个数组
    // printf("%zu\n", sizeof(a)); // 此处a代表整个数组，输出12字节
    // printf("%p\n", &a);         // 此处a代表整个数组，输出整个数组的地址

    // // 第二含义场景示例
    // int *p_a = a; // 此处a代表首元素a[0]的地址，等价于&a[0]
    // p_a = a + 1;  // 此处a代表首元素a[0]的地址，等价于&a[0]
    // // function(a);      // 此处a代表首元素a[0]的地址，等价于&a[0]
    // scanf("%d", a); // 此处a代表首元素a[0]的地址，等价于&a[0]

    return 0;

}