#include <stdio.h>

int main(int argc, char const *argv[])
{
    //向系统申请一片char类型大小（一个字节->八位）的内存空间，并且把这片内存空间命名为a
    char a;
    //向系统申请一片char类型大小（一个字节->八位）的内存空间，并且把这片内存空间命名为b
    char b;
    //向系统申请一片char类型大小（一个字节->八位）的内存空间，并且把这片内存空间命名为c,同时让这片内存存储10这个数据
    char c=10;
    //向系统申请一片int类型大小（四个字节->三十二位）的内存空间，并且把这片内存空间命名为d,同时让这片内存存储100这个数据
    int d=100;

    printf("变量d的地址是%p\n",&d);
    printf("带参数的输出，想输出整数%d\n",100);
    printf("带参数的输出，想输出字符%c\n",'c');
    printf("带参数的输出，想输出字符%f\n",3.14);
    return 0;
}
